{"intents": [
	 {"tag": "saluti",
	 "patterns": ["ciao", "hey", "buongiorno", "ciao bot", "hey come va?", "ciao ho bisogno di aiuto","mi serve aiuto","ciao, puoi aiutarmi?"],
	 "responses": ["Ciao!", "Hey!", "Buongiorno, come posso aiutarti?", "Ciao, dimmi tutto!", "Hey, hai qualcosa da chiedermi?"]},

	 {"tag": "arrivederci",
	 "patterns": ["grazie per l'aiuto!", "Ci vediamo","grazie","ok", "Tutto chiaro, grazie", "Ci si vede", "grazie mille, alla prossima", "Arrivederci bot","sei stato d'aiuto"],
	 "responses": ["Felice di averti aiutato!", "Arrivederci, a presto!", "Ci vediamo presto", "Alla prossima", "Sono sempre qui per te"]},

	 {"tag": "feel",
	 "patterns": ["come stai?", "tutto bene?", "tutto ok?", "come ti senti?"],
	 "responses": ["Sono pronto per aiutarti!", "Bene, come posso aiutarti?", "Pieno di notizie per te!", "Alla grande."]},

	 {"tag": "curiositá",
	 "patterns": ["Dammi qualche info sulla Parthenope", "Mi dici qualche dato sull'universitá?", "Voglio sapere qualche news sull'universitá", "Posso avere qualche news sull'Ateneo?"],
	 "responses": ["Sempre più studenti scelgono la Parthenope: è quanto registrano i dati diffusi dal Ministero dell’Università e della Ricerca nell’ambito dell’indagine sull’andamento \n delle Università in Italia.", "Il nostro ateneo é impegnato nella campagna Antartide 2023.", "Il CDS di Informatica é considerato uno dei migliori del Sud Italia.", "Sapevi che puoi lavorare per la tua Universitá? Ogni anno vengono emessi dei bandi per collaborazioni studentesche retribuite.", "L'universitá Parthenope é l'unica Universitá Italiana ad avere un accordo di Cooperazione Scientifica e Tecnologica per l'istituzione di un programma accademico su iOS Development.","Il nostro Ateneo é primo del Centro Sud per qualitá della Ricerca e tra i primi dieci in tutta Italia.","La Parthenope é plastic free! Troverai in ogni ateneo un distributore d'acqua, naturale e frizzante, completamente gratuito per la tua borraccia."]},

	 {"tag": "nome",
	 "patterns": ["come ti chiami?", "qual é il tuo nome?", "chi sei?", "puoi dirmi il tuo nome?", "hai un nome?", "non ricordo il tuo nome"],
	 "responses": ["Sono OrientaBot", "Puoi chiamarmi OrientaBot!", "Sono OrientaBot, la tua guida per universitá", "Sono OrientaBot, il tuo nuovo assistente!"]},

	 {"tag": "sedi",
	 "patterns": ["dove si trovano le sedi?", "dove si trova l'universitá?", "in che zona é l'universitá?", "dove sta l'uni?", "dove é situata l'universitá?","quante sedi ha l'universitá?","quanti sedi ci sono?","quali sono le sedi dell'ateneo?", "dove si trova la Parthenope?", "quali sono le sedi della Parthenope"],
	 "responses": ["Ci sono diverse sedi in tutta Napoli e provincia: \n1. La sede centrale dell’Università degli Studi di Napoli “Parthenope” è collocata in Via Ammiraglio Ferdinando Acton n. 38.\n2. Il Palazzo Pacanowski è situato a Napoli, in Via Generale Parisi n. 13, nelle adiacenze della Scuola Militare Nunziatella. Compone dei Dipartimenti di Giurisprudenza,\n Studi Aziendali ed Economici, Studi Aziendali e Quantitativi, Studi Economici e Giuridici.\n3. La sede al Centro Direzionale, che ospita il Dipartimento di Ingegneria e del Dipartimento di Scienze e Tecnologie.\n4. Villa Doria d’Angri, una delle più importanti ville neoclassiche italiane situata a Posillipo, qui potrai seguire il corso Apple Foundation.\n5. In Via Medina, dove ha sede il Dipartimento di Scienze Motorie e del Benessere.\n6. La sede di Nola, ospita tre corsi di laurea triennale in “Economia & Management”, “Ingegneria e Scienze Informatiche per la Cybersecurity” e “Scienze Motorie” \n e un corso di laurea magistrale a ciclo unico in “Giurisprudenza”."]},

	 {"tag": "esami",
	 "patterns": ["Quanti esami ci sono a informatica?", "numero degli esami a informatica", "quanti esami dovró sostenere a informatica?", "quanti esami ha informatica?","Mi dici il numero degli esami di informatica?"],
	 "responses": ["Il CDS di Informatica ha 20 esami, consulta il sito per maggior informazioni.", "Ci sono 20 esami, in bocca al lupo! Se vuoi avere maggior informazioni puoi consultare il nostro sito.", "Dovrai sostenere 20 esami! Puoi trovare il piano di studi sul nostro sito.","Al corso di studi di Informatica ci sono 20 esami. Visita la pagina del corso di studi per avere tutte le info","Ci sono 20 esami al corso di Informatica, consulta il sito della Scuola per maggiori informazioni.","Informatica ha 20 esami, puoi trovare il piano di studi sul sito dell'Ateneo."]},

	 {"tag": "preferito",
	 "patterns": ["qual é il tuo esame preferito?", "che esame ti piace", "qual é la tua materia preferita?"],
	 "responses": ["Il mio esame preferito é... TUTTI", "Il mio esame preferito é Sistemi Operativi!", "Sono un robot, secondo te?", "Il mio esame preferito é Algoritmi e Strutture Dati!"]},

	 {"tag": "segreteria",
	 "patterns": ["A che ora apre la segreteria?", "la segreteria é aperta?", "quali sono gli orari della segreteria?", "a che ora posso andare in segreteria?"],
	 "responses": ["La segreteria é aperta tutti i giorni dalle 09.00 alle 11.00", "La segreteria é aperta ogni giorno dalle 09.00 alle 11.00", "Puoi andare in segreteria tutti i giorni dalle 09.00 alle 11.00"]},

	 {"tag": "sito",
	 "patterns": ["Qual é il sito della scuola?", "Qual é il sito dell'ateneo?", "Qual é il sito?", "Qual é il sito dell'universitá?","Qual é il sito della Parthenope?"],
	 "responses": ["Il sito dell'Universitá é https://www.uniparthenope.it. Qui puoi trovare tutto ció che cerchi."]},

	 {"tag": "apertura",
	 "patterns": ["Quando é aperta l'universitá?","a che ora chiude l'universitá?", "in che giorni posso andare in sede?", "quali sono i giorni per andare in universitá?","Quando é aperta la Parthenpope?"],
	 "responses": ["L'universitá é aperta dal lunedí al venerdí, dalle 08.00 fino alle 19.30.", "Dal lunedí al venerdí, dalle 08.00 fino alle 19.30.", "Puoi andare in sede dal lunedí al venerdí, dalle 08.00 fino alle 19.30."]},

	 {"tag": "trasporto",
	 "patterns": ["Come arrivo al centro direzionale?","Come arrivo al cdr?","cdr","centro direzionale","come arrivare al centro direzionale","Come arrivo in sede?", "Qual è la strada per andare al centro direzionale?", "Posso arrivare al centro direzionale col treno?","Come arrivo alla Parthenope?"],
	 "responses": ["Puoi arrivare al centro Direzionale in diversi modi molto comodi: se abiti a Napoli puoi prendere la Metropolitana e fermarti a Garibaldi,\n dopo 5 minuti di passeggiata sarai arrivato al CDR. \nSe provieni dai paesi vesuviani o limitrofi puoi usufruire del servizio offerto dall'EAV: basta scendere alla fermata Centro Direzionale e il gioco é fatto!", "Puoi prendere la Metro e scendere a Garibaldi oppure utilizzare il servizio ferroviario EAV e scendere all fermata Centro direzionale."]},

	 {"tag": "rettore",
	 "patterns": ["Come si chiama il rettore?", "Qual è il nome del rettore?", "Chi é il rettore dell'universitá?"],
	 "responses": ["Il nome del Magnifico Rettore é il Prof. Alberto Carotenuto.", "Il Rettore dell'Universitá Parthenope é il Professore Alberto Carotenuto, eletto per il sessennio 2022 - 2028."]},

	 {"tag": "wifi",
	 "patterns": ["Come si accede al wifi?","come mi connetto al wifi","come mi connetto a internet", "come accedo al wifi?", "come accedo a internet?","c'é una rete internet?", "come mi collego a internet?", "come mi collego al wifi?"],
	 "responses": ["Per avere accesso alla rete Wi-Fi dell'Ateneo devi collegarti a eduroam. Inserisci le te credenziali [matricola e password] per connetterti.","L'universitá Parthenope offre un ottimo servizio Internet libero per tutti gli studenti, basterá collegarsi alla rete EDUROAM e il gioco é fatto.","Collegati alla rete EDUROAM con le tue credenziali [matricola e password] per accedere alla rete Internet di tutte le Sedi."]},

	 {"tag": "cds",
	 "patterns": ["Che corsi ci sono?","cosa si studia alla Parthenope?", "che corsi di studi ci sono?", "quali sono i corsi di studio?", "quali sono i corsi?", "quali sono le facoltá?", "che facoltá ci sono?"],
	 "responses": ["L'univesitá Parthenope offre una vasta gamma di corsi di studi: \nInformatica \nConduzione del Mezzo Navale\nEconomia Aziendale\nEconomia e Commercio\nEconomia e Management – Sede di Nola\nGiurisprudenza (magistrale a ciclo unico)\nGiurisprudenza (magistrale a ciclo unico) – Sede di Nola\nIngegneria Civile e Ambientale per la Mitigazione dei Rischi\nIngegneria e Scienze Informatiche per la Cybersecurity – Sede di Nola\nIngegneria Gestionale\nIngegneria Informatica, Biomedica e delle Telecomunicazioni\nManagement delle Imprese Internazionali\nManagement delle Imprese Turistiche\nScienze Biologiche\nScienze dell’Amministrazione, dell’Organizzazione e Consulenza del Lavoro\nStatistica e Informatica per l’Azienda, la Finanza e le Assicurazioni\nScienze Nautiche, Aeronautiche e Meteo-oceanografiche\nScienze Motorie\nScienze Motorie – Sede di Nola"]},

	 {"tag": "immatricolazione",
	 "patterns": ["Come faccio ad immatricolarmi?","come immatricolarsi", "come faccio l'iscrizione?", "come mi iscrivo all'universitá?","come iscriversi","come iscriversi all'universitá","come mi immatricolo","come mi iscrivo","qual é la procedura per iscriversi"],
	 "responses": ["Stai per iscriverti per la prima volta all'Università? \nEcco tutti i passaggi che dovrai fare per immatricolarti. Accedi al tuo profilo esse3.\n 1. Compilazione della domanda di immatricolazione\n 2. Seleziona il tipo di immatricolazione [standard, part time, studente rinunciatario...]\n 3. Seleziona il Corso di Studi. \n 4. Inserisci il tuo ISEE Universitario. \n 5. Effettua l'upload di tutti i tuoi documenti. \n 6.Inserire l'anno accademico e controlla che i dati sono corretti. \n 7. Pagamento delle tasse di iscrizione. \n Se hai bisogno di aiuto puoi recarti in sede e chiedere alla segreteria per tutte le informazioni che desideri."]},

	 {"tag": "servizi",
	 "patterns": ["Mi elenchi i servizi dell’ateneo?","che servizi ci sono", "Che servizi offre l’univeristá?", "Cosa offre l'Universitá?","Di che servizi posso usufruire?"],
	 "responses": ["L'universitá offre molti servizi: puoi trovare una biblioteca dove studiare e reperire libri, aulee studio e tanto altro. Vieni a farci visita, OrientaBot ti aspetta!", "L'Ateneo offre molti servizi: c'é una biblioteca dove studiare, aulee studio capienti e silenziose, gadget personalizzati e tanto altro. Vieni a farci visita, OrientaBot ti aspetta!","Biblioteca, sale informatiche, distributore d'acqua, bar e tanto altro. Vieni in sede a farci visita, OrientaBot ti aspetta :)"]},

	 {"tag": "uso",
	 "patterns": ["A cosa servi?","cosa posso chiederti", "A che servi?", "Cosa mi puoi dire?","In cosa mi puoi aiutare?","cosa sai fare","che sai fare","che ti posso chiedere","cosa ti posso chidere"],
	 "responses": ["Sono stato creato per poter aiutare gli studenti che cercano informazioni riguardo l'Ateneo, tasse, segreteria, lezioni, immatricolazioni e tanto altro. \nProva a chiedermi qualcosa e cercheró di esserti utile!"]},

	 {"tag": "sportello",
	 "patterns": ["C'é uno sportello psicologico?","Vorrei un supporto psicologico", "Come accedo allo sportello psicologico?", "C'é il servizio di supporto psicologico?"],
	 "responses": ["L’Università degli Studi di Napoli “Parthenope” mette a disposizione di tutti gli studenti che vivono situazioni di disagio psicologico,\nche si ripercuotono anche nella propria attività di studio, di ricerca o di lavoro, un supporto gratuito che prevede brevi cicli di incontri\nin presenza o da remoto tramite Skype, a seconda della scelta della persona e sempre nel massimo rispetto della privacy.\n Per accedere al Servizio è sufficiente inviare una mail a antonia.cunti@uniparthenope.it con la richiesta di un appuntamento."]},

	 {"tag": "smartCard",
	 "patterns": ["come richiedere la smart card?","come si fa la smart card?","come faccio la carta adisurc?","come faccio la scheda adisurc?", "come fare la card della mensa?", "come si fa la smart card della mensa?","come faccio a richiedere la smart card?","come si fa la smart card adisurc?","come faccio a richiedere la smart card?"],
	 "responses": ["Tutti gli studenti possono richiedere la Smart Card Adisurc per la mensa universitaria. \n1.Clicca su www.adisurccampania.it \n2.Seleziona la tua Universitá e accedi con credenziali SPID o CIE \n3.Seleziona anno e smart card prima emissione \n4.Stampa il modulo, compilalo e consegnalo alla sede ADISURC in via de Gaspari 45, NA."]},

	 {"tag": "tesi",
	 "patterns": ["Come richiedere la tesi","Come faccio a richiedere la tesi?", "richiesta tesi", "a chi devo chiedere per la tesi?","come si chiede la tesi?"],
	 "responses": ["Per richiedere la tesi devi andare dal Professore che hai scelto e vedere la sua disponibilitá. Dopo accedi al tuo profilo esse3 e alla voce 'Laurea' avrai tutte le istruzioni.\n In bocca al lupo!"]},

	 {"tag": "tirocinio",
	 "patterns": ["Come inizio il tirocinio?","hai info sul tirocinio?", "aiuto tirocinio", "Come si inizia il tirocinio?","A chi devo chiedere per il tirocinio?"],
	 "responses": ["Per iniziare il tirocinio dovrai aver completato gli esami obbligatori, ad esempio se sei uno studente di Informatica dovrai aver completato Algoritmi e Strutture Dati,\n Sistemi Operativi, Programmazione III, Basi di Dati. Recati dal responsabile dei tirocini cercandolo sul sito e inviagli una mail di richiesta. Il responsabile per Informatica é il Prof. Antonio Maratea. Buon lavoro!"]},

	 {"tag": "zonaStudio",
	 "patterns": ["Posso studiare in sede?", "C'é una biblioteca dove studiare?", "Posso studiare in universitá?","Ci sono aulee studio?","biblioteca e aulee studio"],
	 "responses": ["Puoi studiare in sede tutti i giorni feriali, ci sono molti spazi dedicati allo studio su ogni piano dell'edificio oppure puoi recarti in biblioteca.", "Puoi studiare in biblioteca, in aula studio o in uno dei banchi che si trovano sui piani dell'edificio!"]},

	 {"tag": "tolc",
	 "patterns": ["C'é un tolc da superare?","Devo fare il test di ingresso?","Per essere ammesso devo superare una prova?","Tolc","Devo superare un test di ingresso?"],
	 "responses": ["Per iscriverti al corso di Informatica dovrai sostenere un test di autovalutazione: non c'é nessun requisito o punteggio per essere ammesso."]},

	 {"tag": "portineria",
	 "patterns": ["Ho dimenticato il mio ombrello in aula, come posso ritrovarlo?","Ho perso lo zaino in sede","Ho smarrito il tablet in aula","Ho lasciato il mio quaderno in aula come posso ritrovarlo?","Ho perso la mia penna","Ho dimenticato la mia borsa", "Ho perso il mio cellulare, come posso ritrovarlo?","Esiste un centro di oggetti smarriti?"],
	 "responses": ["Mi dispiace per il tuo oggetto! Prova ad andare in portineria, c'é il centro di oggetti smarriti."]},

	 {"tag": "tasse",
	 "patterns": ["Quante tasse devo pagare?", "Quante tasse dovró pagare?", "Come faccio a sapere quante tasse devo pagare?","tasse simulatore","voglio simulare quante tasse dovró pagare"],
	 "responses": ["L'universitá Parthenope é sempre dal lato degli studenti: esiste una no tax area se il tuo ISEE é inferiore a 28.000 euro. \nSe cosí non fosse puoi accedere al simulatore tasse per vedere quante tasse dovrai pagare. Inoltre avrai dei benefit se nel corso dei tuoi studi riuscirai a maturare un numero di CFU stabilito."]},

	 {"tag": "social",
	 "patterns": ["Quali social ha la Parthenope?","Quali sono i vostri social?","Dove posos seguire la parthenope?","Quali sono i social della Parthenope?", "C'é la Parthenope su Facebook?", "C'é il profilo Facebook?","C'é il profilo instagram?","C'é il profilo twitter?","dove posso seguire gli aggiornamenti?"],
	 "responses": ["Puoi seguire la Parthenope su tutti i social: Facebook, Instagram, Twitter e Youtube. Resta sempre aggiornato con noi!"]},

	 {"tag": "sessioni",
	 "patterns": ["Quali sono le sessioni di esame?", "Quando si fanno gli esami?", "Quando inizia la sessione?","Quando iniziano gli esami?","In che mesi posso fare esami?"],
	 "responses": ["La sessione invernale va dal mese di Gennaio a Marzo, la sessione estiva va da Giugno a Settembre, escluso Agosto. Buona Fortuna!", "Le sessioni vanno da Gennaio a Marzo e da Giugno a Settembre.", "Puoi fare esami nella sessione invernale [Gennaio - Marzo] e in quella estiva [Giugno - Settembre]."]},

	 {"tag": "orarioLezioni",
	 "patterns": ["dove posso leggere gli orari delle lezioni?", "orario lezioni", "a che ora ci sono le lezioni?", "a che ora iniziano le lezioni?","a che ora stanno le lezioni","quando iniziano le lezioni?"],
	 "responses": ["Puoi controllare gli orari delle lezioni sul nostro sito, se invece ti trovi in sede troverai i nostri monitor nei corridoi con tutte gli orari delle lezioni.", "Puoi consultare il sito della scuola, troverai gli orari di tutti i corsi di studi.", "Se sei in universitá puoi contollare sui monitor nei corridoi oppure recati sul sito della scuola."]}
]}